Tekla Open API Reference for Tekla Structures 2025
PointPlacing Class
 The PointPlacing class defines a placing where the object is placed at one point (the insertion point) without any additional placing options.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PlacingBase
 Tekla.Structures.Drawing.PointPlacing
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PointPlacing : PlacingBase
<SerializableAttribute>
Public Class PointPlacing
	Inherits PlacingBase
The PointPlacing type exposes the following members.
Constructors
Name | Description
PointPlacing
 Creates a new point placing instance. The value used for the placing is the parent object's insertion point in this case.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PlacingBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace